CREATE TABLE [data] (
  [Порядковый_номер] INTEGER,
  [ФИО] VARCHAR(50),
  [Дата_рождения] VARCHAR(50),
  [Курс] INTEGER,
  [Предмет] VARCHAR(50),
  [Балл] INTEGER
);
INSERT INTO [data] (
  [Порядковый_номер],
  [ФИО],
  [Дата_рождения],
  [Курс],
  [Предмет],
  [Балл]
) VALUES 
 ('1','Иванов И.И.','02.01.1989','5','Информатика','4'), 
 ('2','Петров П.П.','13.05.1991','4','Информатика','3'), 
 ('3','Сидоров В.В.','14.08.1990','4','Информатика','5'), 
 ('4','Коршунов П.И.','12.12.1988','5','Информатика','2'), 
 ('5','Артёмов П.Р.','01.04.1996','2','Информатика','2'), 
 ('6','Соколов Д.И.','21.02.1997','1','Информатика','5'), 
 ('7','Внуков К.Е.','18.09.1987','5','Информатика','3'), 
 ('8','Климов А.А.','11.07.1997','1','Информатика','4'), 
 ('9','Алексеенко И.А.','29.05.1999','1','Информатика','5'), 
 ('10','Дедов И.Л.','04.11.1992','3','Информатика','4'), 
 ('11','Иванов И.И.','02.01.1989','5','Экономика','2'), 
 ('12','Петров П.П.','13.05.1991','4','Экономика','3'), 
 ('13','Сидоров В.В.','14.08.1990','4','Экономика','5'), 
 ('14','Коршунов П.И.','12.12.1988','5','Экономика','4'), 
 ('15','Артёмов П.Р.','01.04.1996','2','Экономика','5'), 
 ('16','Соколов Д.И.','21.02.1997','1','Экономика','3'), 
 ('17','Внуков К.Е.','18.09.1987','5','Экономика','4'), 
 ('18','Климов А.А.','11.07.1997','1','Экономика','4'), 
 ('19','Алексеенко И.А.','29.05.1999','1','Экономика','5'), 
 ('20','Дедов И.Л.','04.11.1992','3','Экономика','4');

-- 1. Показать всех рождённых в СССР, имеющих оценку не ниже «3» по информатике

DROP VIEW IF EXISTS cybers
GO
CREATE VIEW cybers AS SELECT * FROM data
WHERE [Предмет] = 'Информатика' AND [Балл] >= 3
GO
SELECT * FROM cybers


-- 2. Вывести список «Топ студентов», имеющих отлично по двум дисциплинам

DROP VIEW IF EXISTS top_students
GO
CREATE VIEW top_students AS SELECT cybers.[ФИО] FROM data as cybers
JOIN data as economics
ON cybers.[ФИО] = economics.[ФИО]
WHERE cybers.[Предмет] = 'Информатика' AND cybers.[Балл] = 5 
AND economics.[Предмет] = 'Экономика' AND economics.[Балл] = 5 
GO
SELECT * FROM top_students

-- более чистый вариант

-- WITH cybers AS (
--   SELECT * 
--   FROM data 
--   WHERE [Предмет] = 'Информатика' AND [Балл] = 5
-- ),
-- economics AS (
--   SELECT * 
--   FROM data 
--   WHERE [Предмет] = 'Экономика' AND [Балл] = 5
-- )

-- SELECT cybers.[ФИО] 
-- FROM cybers
-- JOIN economics 
-- ON cybers.[ФИО] = economics.[ФИО]

-- 3. Вывести информацию о количестве студентов на каждом из курсов

DROP VIEW IF EXISTS count_of_students
GO
CREATE VIEW count_of_students AS SELECT [Курс], COUNT([Курс])
FROM (SELECT distinct [ФИО], [Курс] FROM data)
GROUP BY [Курс]
GO
SELECT * FROM count_of_students

-- 4. Вывести список студентов, сумма цифр в дате рождения у которых меньше 50

DROP VIEW IF EXISTS date_of_birthday_50
GO
CREATE VIEW date_of_birthday_50 AS SELECT distinct [ФИО], [Дата_рождения], 
  cast(substring([Дата_рождения], 1,1) as int)
  +substring([Дата_рождения], 2,1)
  +substring([Дата_рождения], 4,1)
  +substring([Дата_рождения], 5,1)
  +substring([Дата_рождения], 7,1)
  +substring([Дата_рождения], 8,1)
  +substring([Дата_рождения], 9,1)
  +substring([Дата_рождения], 10,1) as sum_of_date 
FROM data 
ORDER BY sum_of_date DESC
GO
SELECT * FROM date_of_birthday_50
